class TextAbout {
  static const infoAppDescription = "RubicsGuide 2 - обучение сборке кубика Рубика";

  static const version = "ver. 3.20210101.1";

  static const text = """
    <p>Эта программа поможет вам научиться собирать кубик Рубика и многие другие шарнирные головоломки
    разными методами.</p>
    
    <p>В программе использованы обучающие видео с моего канала
    <a href=https://www.youtube.com/channel/UCpSUF7w376aCRRvzkoNoAfQ>RubicsGuide</a> в ютубе,
    а также каналов
    <a href=https://www.youtube.com/channel/UCcPBYu6k4XQPTxu2keyUDWw>Максима Чечнева,</a>
    <a href=https://www.youtube.com/channel/UCtaSSWS3QfyhZWyNwoTalKQ>Яна Корзюка,</a>
    <a href=https://www.youtube.com/user/fazrulz1/about>Феликса Земдегса</a>,
    <a href=https://www.youtube.com/channel/UCqTVfT9JQqhA6_Hi_h_h97Q>Дилана Ванга</a> и
    <a href=https://www.youtube.com/channel/UCgeAeUW_cb_avda0sBMUTmQ>Криса Олсона</a>.
    Заходите, подписывайтесь и ставьте лайки.
    </p>
    
    <p>Программа позволяет легче ориентироваться в используемых обучающих видео, благодаря иконкам, отображающим
    основные рассмотренные в них моменты. Содержит ссылки в тексте, позволяющие просматривать видео
    с определенного момента. А также алгоритмы в виде формул, для быстрого запоминания/вспоминания в оффлайн режиме.<br/>
    Так же вы можете делать для себя заметки (комментарии) к каждому этапу.</p>
    
    <p>Даже если вы уже умеете собирать кубик, рекомендую изучить мою методику
    или методику Максима для начинающих. Это поможет вам понять тот язык (
    <a href="rg2://ytplay?time=11:15&link=8VCsFNFa5yM"><b>\"Лондон\",</b></a>
    <a href="rg2://ytplay?time=8:16&link=ku-FyZvD48Q"><b>\"свет\"</b></a> и
    <a href="rg2://ytplay?time=7:58&link=8VCsFNFa5yM"><b>\"крыша\"</b></a>), который лежит
    в основе видео и применяется в данной программе.</p>
    
    <p>Спасибо всем приславшим свои замечания и предложения по работе
    программы, особенно Ивану Полканову, Денису Бондаревскому, Антону Очаковскому и Илье Богданову.
    Отдельное спасибо Никите Степанову и Демиду Метельникову за помощь в написании гайдов.
    Ну и конечно же Глебу Любичу, главному корректору текстов и просто генератору хороших идей. Надеюсь, что его проект
    <a href="https://www.instagram.com/legkoporossii/">#ЛегкоПоРоссии</a> будет развиваться.
    Ребята, благодаря вам и вашей помощи, я сделал эту замечательную обучалку!
    А так же, продолжаю её совершенствовать, улучшать и дополнять! Вместе мы сделаем её ещё лучше!
    </p>
    
    <p>Информацию об ошибках, а так же свои пожелания по развитию программы, ссылки на интересные
    видео, которые вы бы хотели видеть в программе, можете присылать мне на адрес
    <a href="mailto:rubicsguide@yandex.ru?subject=RG2&body=Здравствуйте,%20Антон.">rubicsguide@yandex.ru</a>.
    </p>
    
    <p>Если вы хотите увидеть с чего все начиналось, можете скачать вот
    <a href="https://www.dropbox.com/s/zoiiwewwkoalwmg/rg1.apk?dl=0">по этой ссылке</a>
    самую первую версию программы для Android (от 11.07.2017).</p>
    
    <br/>
    <br/>
    <p>Антон Розов<br/>
    <a href="mailto:rubicsguide@yandex.ru?subject=Вопрос%20по%20RG2&body=Здравствуйте,%20Антон.">rubicsguide@yandex.ru</a></p>
    <br/>
    <br/>
    <br/>
    
  """;
}